# Folder Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroManager..::..Folder Property
MacroManager Class See Also
---
The modules folder. The path for document macros will not persist except while the document is loaded in this session.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string Folder { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Folder As String
	Get
```

Visual C++
---
```text
public:
property String^ Folder {
	String^ get ();
}
```

# See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace